Revit 2027 API
IFCFile.GetInstanceCount Method
 Counts IFC instances of one particular type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetInstanceCount(
	string entityName,
	bool includeSubTypes
)
Public Function GetInstanceCount (
	entityName As String,
	includeSubTypes As Boolean
) As Integer
public:
int GetInstanceCount(
	String^ entityName,
	bool includeSubTypes
)
member GetInstanceCount :
        entityName : string *
        includeSubTypes : bool -> int
Parameters
entityName String
 The name of the instance type.
includeSubTypes Boolean
 True to count instances of sub types.
Return Value
Int32
 The count.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace